src/main/resources/xmls/salesforcequery/CreateVMSReqTeamRequest.xml

	<Envelope xmlns="http://schemas.xmlsoap.org/soap/envelope/"

 	xmlns:p1="http://www.w3.org/2001/XMLSchema-instance">

	<Header>
	<SessionHeader xmlns="urn:partner.soap.sforce.com">
	<sessionId></sessionId>
</SessionHeader>
</Header>
<Body>
<create xmlns="urn:partner.soap.sforce.com">
<sObjects>
 <type xmlns="urn:sobject.partner.soap.sforce.com">VMS_Req_Team__c</type>
                   <Name xmlns=""></Name>
                    <User__c xmlns=""></User__c>
                   <Role__c xmlns=""></Role__c>
                   <VMS_Configuration__c xmlns=""></VMS_Configuration__c>
                   </sObjects>
				</create>
			</Body>
</Envelope>