src/main/resources/xmls/salesforcequery/UpdateESFAPIRequest.xml

<Envelope xmlns="http://schemas.xmlsoap.org/soap/envelope/"
	xmlns:p1="http://www.w3.org/2001/XMLSchema-instance">
	<Header>
		<SessionHeader xmlns="urn:partner.soap.sforce.com">
			<sessionId></sessionId>
		</SessionHeader>
	</Header>
	<Body>
		<update xmlns="urn:partner.soap.sforce.com">
			<sObjects>
				<type xmlns="urn:sobject.partner.soap.sforce.com">Employee_Status_Form__c</type>
				<Id xmlns=""></Id>
				<ACT_status__c xmlns=""></ACT_status__c>
				<Stage__c xmlns=""></Stage__c>
				<Approved_Date__c xmlns=""></Approved_Date__c>
				<Cleared_to_Start__c xmlns=""></Cleared_to_Start__c>
				<FSG_Owner__c xmlns=""></FSG_Owner__c>
				<On_Hold_Comments__c xmlns=""></On_Hold_Comments__c>
				<On_Hold_Date__c xmlns=""></On_Hold_Date__c>
				<On_Hold_Reason__c xmlns=""></On_Hold_Reason__c>
				<On_Hold__c xmlns=""></On_Hold__c>
				<Reject_Status__c xmlns=""></Reject_Status__c> 
				<Reject_Comments__c xmlns=""></Reject_Comments__c>
				<Reject_Date__c xmlns=""></Reject_Date__c>
				<Reject_Reason__c xmlns=""></Reject_Reason__c>
			</sObjects>
		</update>
	</Body>
</Envelope>