src/main/resources/xmls/salesforcequery/CreateTalentExpWithEdu.xml

<Envelope xmlns="http://schemas.xmlsoap.org/soap/envelope/" xmlns:p1="http://www.w3.org/2001/XMLSchema-instance">
   <Header>
      <SessionHeader xmlns="urn:partner.soap.sforce.com">
         <sessionId></sessionId>
      </SessionHeader>
   </Header>
   <Body>
      <create xmlns="urn:partner.soap.sforce.com">
         <sObjects>
            <type xmlns="urn:sobject.partner.soap.sforce.com">Talent_Experience__c</type>
            <Talent__c xmlns=""></Talent__c>
            <Type__c xmlns=""></Type__c>
            <Client__c xmlns=""></Client__c>
            <Degree_Level__c xmlns=""></Degree_Level__c>
            <Graduation_Year__c xmlns=""></Graduation_Year__c >
            <Honor__c xmlns=""></Honor__c>
            <Major__c xmlns=""></Major__c>
            <Organization_Name__c xmlns=""></Organization_Name__c>
            <Certification__c xmlns=""></Certification__c>
            <Notes__c xmlns=""></Notes__c>
            <Education_Organization__c xmlns=""></Education_Organization__c>           
          </sObjects>
      </create>
   </Body>
</Envelope>
