src/main/resources/xmls/salesforcequery/UpdateESFValue.xml

<Envelope xmlns="http://schemas.xmlsoap.org/soap/envelope/"
	xmlns:p1="http://www.w3.org/2001/XMLSchema-instance">
	<Header>
		<SessionHeader xmlns="urn:partner.soap.sforce.com">
			<sessionId></sessionId>
		</SessionHeader>
	</Header>
	<Body>
		<update xmlns="urn:partner.soap.sforce.com">
			<sObjects>

				<type xmlns="urn:sobject.partner.soap.sforce.com">Employee_Status_Form__c</type>
				<Id xmlns=""></Id>
				<Employment_Type__c xmlns=""></Employment_Type__c>
				<FSG_Federation_ID__c xmlns=""></FSG_Federation_ID__c>
				<OwnerId xmlns=""></OwnerId>
			</sObjects>
		</update>
	</Body>
</Envelope>