src/main/resources/xmls/salesforcequery/UpdateESFWithPSProjectInfo.xml

<Envelope xmlns="http://schemas.xmlsoap.org/soap/envelope/"
	xmlns:p1="http://www.w3.org/2001/XMLSchema-instance">
	<Header>
		<SessionHeader xmlns="urn:partner.soap.sforce.com">
			<sessionId></sessionId>
		</SessionHeader>
	</Header>
	<Body>
		<update xmlns="urn:partner.soap.sforce.com">
			<sObjects>

				<type xmlns="urn:sobject.partner.soap.sforce.com">Employee_Status_Form__c</type>
				<Id xmlns=""></Id>
				<PeopleSoft_Customer_ID__c xmlns=""></PeopleSoft_Customer_ID__c>
				<PeopleSoft_Customer_Name__c xmlns=""></PeopleSoft_Customer_Name__c>
				<PeopleSoft_Project_Description__c xmlns=""></PeopleSoft_Project_Description__c>
				<PeopleSoft_Project_ID__c xmlns=""></PeopleSoft_Project_ID__c>
				<Practice__c xmlns=""></Practice__c>
				<Practice_ID__c xmlns=""></Practice_ID__c>
				<Business_Unit__c xmlns=""></Business_Unit__c>
			</sObjects>
		</update>
	</Body>
</Envelope>